eisup_2019_docmng_integration/src/Documents/абс_ЗадачаВТехподдержку/абс_ЗадачаВТехподдержку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_ЗадачаВТехподдержку</name>
  <posting>Deny</posting>
  <attributes>
    <name>Инициатор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.абс_СтатусыЗаявокВПоддержку</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаВыполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВключенаВПланРабот</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстВопроса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОтвета</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗаявки</name>
    <type>
      <types>EnumRef.абс_ТипЗаявкиВПоддержку</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаИзмененияСтатуса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СменаИсполнителя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КлассификацияПроблемы</name>
    <type>
      <types>CatalogRef.абс_КлассификацияПроблемСопровождения</types>
    </type>
  </attributes>
  <attributes>
    <name>УточнениеИсполнителем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделСопровождения</name>
    <type>
      <types>CatalogRef.абс_РазделыСопровождения</types>
    </type>
  </attributes>
  <attributes>
    <name>Трудоемкость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>EnumRef.абс_ПриоритетыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоСтатуса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НезавершеннаяЗаявка</name>
    <type>
      <types>DocumentRef.абс_ЗадачаВТехподдержку</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВажноДляДирМФС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтарыйСтатус</name>
    <comment>Заполняется когда заявка переходит в статус «уточнение»</comment>
    <type>
      <types>EnumRef.абс_СтатусыЗаявокВПоддержку</types>
    </type>
  </attributes>
  <attributes>
    <name>ВажностьЗаявки</name>
    <type>
      <types>EnumRef.абс_ВажностьЗаявки</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДляИсполнителя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Задача</name>
    <type>
      <types>CatalogRef.абс_ЗадачиДляЗаявокВПоддержку</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефоннаяКонсультация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВозможногоТестирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительноеСогласование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СотрудникДополнительногоСогласования</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ФактМинут</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентИсполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДляКонтроля</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланированиеВыполнения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекущееВыполнениеСтатус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаВозникновенияЗаявок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Исполнители</name>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>РасшифровкаИсполнителя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>75</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РасшифровкаРабот</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Параметры</name>
    <attributes>
      <name>ИмяПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>75</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПараметра</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоВыражение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СинонимПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>75</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/InformationRegisters/РолиИИсполнители/РолиИИсполнители.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РолиИИсполнители</name>
  <resources>
    <name>абс_ИндексИсполнителя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Роль</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Documents/абс_ЗадачаВТехподдержку/Forms/ФормаСписка/Module.bsl
//АБС Шамов
Перем мОрганизацииДляОтчета;
//\\АБС Шамов

&НаКлиенте
Процедура СменитьСтатус(Команда)
	
	СтрокаСтатуса = Неопределено;
	Отказ = Ложь;
	СписокДокументов = Новый СписокЗначений;
	
	Для Каждого ВыделеннаяСтрока Из Элементы.Список.ВыделенныеСтроки Цикл
		СписокДокументов.Добавить(ВыделеннаяСтрока.Ссылка);
		Если не СтрокаСтатуса = Неопределено Тогда
			Отказ = Отказ или не СтрокаСтатуса = ВыделеннаяСтрока.Ссылка.Статус;
		КонецЕсли;
		СтрокаСтатуса = ВыделеннаяСтрока.Ссылка.Статус; 	
	КонецЦикла;
	
	Если Отказ Тогда
		Сообщить("Выбранные документы имеют разный статус.
		|Для группового изменения статуса нужно выбрать документы одного статуса.",СтатусСообщения.Важное); 		
		Возврат;	
	КонецЕсли;	
	
	Если не ЗначениеЗаполнено(СтрокаСтатуса) или не ЗначениеЗаполнено(СписокДокументов) Тогда		
		Возврат;	
	КонецЕсли;
	
	СписокДоступныхСтатусов = Новый СписокЗначений; 
	Документы.абс_ЗадачаВТехподдержку.ЗаполнитьСписокДоступныхСтатусов(СписокДокументов[0].Значение, СписокДоступныхСтатусов);
	ФормаВыбораСтатуса = Документы.абс_ЗадачаВТехподдержку.ПолучитьФорму("ФормаГрупповогоВыбораСтатуса");	
	ФормаВыбораСтатуса.ЭлементыФормы.ВыбСтатус.СписокВыбора = СписокДоступныхСтатусов;
	ФормаВыбораСтатуса.ЭлементыФормы.ВыбСтатус.Значение 	= СтрокаСтатуса;	
	ФормаВыбораСтатуса.СписокПервичныхДокументов.ЗагрузитьЗначения(СписокДокументов.ВыгрузитьЗначения());
	
	РезультатВыбораСтатуса = ФормаВыбораСтатуса.ОткрытьМодально();	
	Если РезультатВыбораСтатуса = Неопределено 
		или РезультатВыбораСтатуса.СписокДокументов.Количество() = 0  
		или РезультатВыбораСтатуса.НовыйСтатус = СтрокаСтатуса Тогда
		Возврат;
	КонецЕсли;
	
	ИзменитьСтатусСпискаДокументов(РезультатВыбораСтатуса.СписокДокументов
									,РезультатВыбораСтатуса.ПричинаСменыСтатуса
									,РезультатВыбораСтатуса.НовыйСтатус);	
	
КонецПроцедуры   

&НаСервере
Процедура ИзменитьСтатусСпискаДокументов(СписокДокументов,ПричинаИзмененияСтатуса,НовыйСтатус)
	
	Для Каждого СтрокаДокументов Из СписокДокументов Цикл
				
		// Изменим текущий статус		
		ДокументСсылка = СтрокаДокументов.ПервичныйДокумент;  
		Если НЕ ЗначениеЗаполнено(ДокументСсылка) Тогда
			Продолжить;
		КонецЕсли;	
		
		ДокументОбъект 			    = ДокументСсылка.ПолучитьОбъект();			
		СтарыйСтатус 			    = ДокументОбъект.Статус;		
		ДокументОбъект.Статус	    = НовыйСтатус;  
		ДокументОбъект.Исполнитель	= СтрокаДокументов.Исполнитель;
		ДокументОбъект.ПричинаИзмененияСтатуса = ПричинаИзмененияСтатуса;
		
		Попытка 
			ДокументОбъект.Записать();  			
			Сообщить("Первичный документ: " + ДокументСсылка + " переведен в статус " + НовыйСтатус + ".");
		Исключение			
			ttk_ОбщегоНазначения.СообщитьОбОшибке("Первичный документ: " + ДокументСсылка + ": не удалось установить статус " + НовыйСтатус + ".");
		КонецПопытки;
		
	КонецЦикла;	 	
	  	
КонецПроцедуры
//АБС Шамов
&НаКлиенте
Процедура ПриОткрытии(Отказ)

	//// 	// блокировка ввода новых заявок 
	////Если Параметры.Ключ.Пустая() Тогда
	//////Если ЗначениеЗаполнено(Объект.Ссылка) ТОгда
		Если ТекущаяДата() >= '20160111' Тогда
			Если РольДоступна("ПолныеПрава") Тогда
				// а мы особенные
				
				Режим = РежимДиалогаВопрос.ДаНет;
				Текст = "ru = ""Новые заявки создавать нельзя, но Вы особенный... Действительно создать новую заявку?"";"
				+ " en = ""Do you want to continue?""";
				Ответ = Вопрос(НСтр(Текст), Режим, 0);
				Если Ответ = КодВозвратаДиалога.Нет Тогда
					// отказался, значит и ему нельзя
	              	Отказ = Истина;
					Возврат;
				КонецЕсли;
				
			Иначе
				// всем запрещено вводить
				Сообщить("Ввод новых заявок на поддержку по ЕИСУП и ИСУЗК заблокирован. Новые заявки следует создавать в SD.ttk.ru" );
				Предупреждение("Ввод новых заявок на поддержку по ЕИСУП и ИСУЗК заблокирован. Новые заявки следует создавать в SD.ttk.ru",20);
				Отказ = Истина;
				Возврат;  
			КонецЕсли; 
			Если Отказ Тогда
				Возврат;	
			КонецЕсли;
		КонецЕсли;
	//КонецЕсли;

	
	
	Элементы.ОтчетПоЗаявкам.Видимость = ПроверкаДоступностиОтчетаПоЗаявкам();
	
КонецПроцедуры

&НаСервере
Функция ПроверкаДоступностиОтчетаПоЗаявкам(ОрганизацииОтбор = Неопределено)
	
	ОрганизацииОтбор = Новый СписокЗначений;
	
	Если СокрЛП(ПараметрыСеанса.ТекущийПользователь.Наименование) = "Сотник Вячеслав Анатольевич" ТОгда
		//ему можно всё
		Возврат Истина;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РолиИИсполнители.Организация КАК Организация
		|ПОМЕСТИТЬ втОрганизацииИсполнителя
		|ИЗ
		|	РегистрСведений.РолиИИсполнители КАК РолиИИсполнители
		|ГДЕ
		|	РолиИИсполнители.Исполнитель = &Исполнитель
		|	И РолиИИсполнители.Роль = &Роль
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втОрганизацииИсполнителя.Организация
		|ИЗ
		|	втОрганизацииИсполнителя КАК втОрганизацииИсполнителя";

	Запрос.УстановитьПараметр("Исполнитель", ПараметрыСеанса.ТекущийПользователь);
	Запрос.УстановитьПараметр("Роль", Справочники.РолиИсполнителей.ДирМФС);

	Результат = Запрос.Выполнить();

	Если НЕ Результат.Пустой() ТОгда
		//есть роль ДирМФС
		ОрганизацииОтбор.Очистить();
		
		ВыборкаДетальныеЗаписи = Результат.Выбрать();

		//заполним список организаций, по которым есть доступ
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если НЕ ВыборкаДетальныеЗаписи.Организация.Пустая() Тогда
				ОрганизацииОтбор.Добавить(ВыборкаДетальныеЗаписи.Организация);		
			КонецЕсли;
		КонецЦикла;
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ОтчетПоЗаявкам(Команда)
	
	ОрганизацииОтбор = Неопределено;
	ПроверкаДоступностиОтчетаПоЗаявкам(ОрганизацииОтбор);
	
	ОтчетОбъект = Отчеты.абс_ОтчетПоЗаявкам.Создать();
	ОтчетОбъект.ОрганизацииОтбор = ОрганизацииОтбор;
	ОтчетОбъект.ПолучитьФорму("Отчет.абс_ОтчетПоЗаявкам.Форма.ФормаОтчета").Открыть();
	
КонецПроцедуры
//\\АБС Шамов
